In [1]:
import sqlalchemy as db
import getpass

In [2]:
user = "root"
password = getpass.getpass("Insert password: ")
connectionURI = f"mysql+pymysql://{user}:{password}@localhost/publications"

Insert password: ········

In [3]:
engine = db.create_engine(connectionURI)
print("Connected to server!")

Connected to server!

In [4]:
import pandas as pd

In [8]:
df = pd.read_sql_query("""
    SELECT authors.au_id AUTHOR_ID, authors.au_lname LAST_NAME , authors.au_fname FIRST_NAME, titles.title TITLE, publishers.pub_name PUBLISHER
	FROM authors
    LEFT JOIN titleauthor ON authors.au_id = titleauthor.au_id
    LEFT JOIN titles ON titleauthor.title_id = titles.title_id
    LEFT JOIN publishers ON titles.pub_id = publishers.pub_id;

""",engine)


df.head(5)

,AUTHOR_ID,LAST_NAME,FIRST_NAME,TITLE,PUBLISHER
0,172-32-1176,White,Johnson,Prolonged Data Deprivation: Four Case Studies,New Moon Books
1,213-46-8915,Green,Marjorie,The Busy Executive's Database Guide,Algodata Infosystems
2,213-46-8915,Green,Marjorie,You Can Combat Computer Stress!,New Moon Books
3,238-95-7766,Carson,Cheryl,But Is It User Friendly?,Algodata Infosystems
4,267-41-2394,O'Leary,Michael,Cooking with Computers: Surreptitious Balance ...,Algodata Infosystems

In [12]:
df = pd.read_sql_query("""
SELECT authors.au_id AUTHOR_ID, authors.au_lname LAST_NAME , authors.au_fname FIRST_NAME, publishers.pub_name PUBLISHER, COUNT(titles.title)TITLE_COUNT
	FROM authors 
    LEFT JOIN titleauthor ON authors.au_id = titleauthor.au_id 
    LEFT JOIN titles ON titleauthor.title_id = titles.title_id
    LEFT JOIN publishers ON titles.pub_id = publishers.pub_id
    GROUP BY AUTHOR_ID, PUBLISHER
    ORDER BY TITLE_COUNT DESC;


""",engine)

df.head(5)

     AUTHOR_ID LAST_NAME FIRST_NAME             PUBLISHER  TITLE_COUNT
0  998-72-3567    Ringer     Albert        New Moon Books            2
1  172-32-1176     White    Johnson        New Moon Books            1
2  213-46-8915     Green   Marjorie  Algodata Infosystems            1
3  213-46-8915     Green   Marjorie        New Moon Books            1
4  238-95-7766    Carson     Cheryl  Algodata Infosystems            1

In [9]:
df = pd.read_sql_query("""
    SELECT authors.au_id AUTHOR_ID, authors.au_lname LAST_NAME, authors.au_fname FIRST_NAME, SUM(sales.qty) TOTAL
    FROM authors
    LEFT JOIN titleauthor ON authors.au_id = titleauthor.au_id
    LEFT JOIN sales ON titleauthor.title_id = sales.title_id
    GROUP BY authors.au_id
    ORDER BY TOTAL DESC
    LIMIT 3;

""",engine)

df

     AUTHOR_ID LAST_NAME FIRST_NAME  TOTAL
0  899-46-2035    Ringer       Anne  148.0
1  998-72-3567    Ringer     Albert  133.0
2  427-17-2319      Dull        Ann   50.0